---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.GetRowHeight(System.Int32)
source: html/87b78710-ab83-e54d-7649-8b82fedd3632.htm
---
# Autodesk.Revit.DB.TableSectionData.GetRowHeight Method

Returns a row's height in feet

## Syntax (C#)
```csharp
public double GetRowHeight(
	int nRow
)
```

## Parameters
- **nRow** (`System.Int32`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The given row number nRow is invalid.